{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"bias": true, "W_constraint": null, "b_regularizer": null, "nb_filter": 32, "nb_row": 3, "nb_col": 3, "activity_regularizer": null, "b_constraint": null, "batch_input_shape": [null, 1, 28, 28], "input_dtype": "float32", "name": "convolution2d_1", "dim_ordering": "th", "trainable": true, "W_regularizer": null, "subsample": [1, 1], "init": "glorot_uniform", "activation": "linear", "border_mode": "valid"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_1"}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_1", "dim_ordering": "th", "trainable": true, "pool_size": [2, 2], "border_mode": "valid", "strides": [2, 2]}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"input_dim": null, "W_constraint": null, "b_regularizer": null, "name": "dense_1", "activity_regularizer": null, "b_constraint": null, "output_dim": 128, "bias": true, "trainable": true, "W_regularizer": null, "init": "glorot_uniform", "activation": "linear"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_2"}}, {"class_name": "Dense", "config": {"input_dim": null, "W_constraint": null, "b_regularizer": null, "name": "dense_2", "activity_regularizer": null, "b_constraint": null, "output_dim": 10, "bias": true, "trainable": true, "W_regularizer": null, "init": "glorot_uniform", "activation": "linear"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "softmax", "name": "activation_3"}}], "keras_version": "1.1.0"}