{"config": [{"config": {"border_mode": "valid", "input_dtype": "float32", "nb_filter": 32, "b_regularizer": null, "batch_input_shape": [null, 1, 28, 28], "bias": true, "nb_col": 3, "W_constraint": null, "dim_ordering": "th", "trainable": true, "init": "glorot_uniform", "activity_regularizer": null, "b_constraint": null, "nb_row": 3, "name": "convolution2d_1", "W_regularizer": null, "subsample": [1, 1], "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_1"}, "class_name": "Activation"}, {"config": {"dim_ordering": "th", "trainable": true, "strides": [2, 2], "pool_size": [2, 2], "border_mode": "valid", "name": "maxpooling2d_1"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "bias": true, "W_constraint": null, "trainable": true, "activation": "linear", "output_dim": 128, "name": "dense_1", "W_regularizer": null, "input_dim": null, "init": "glorot_uniform"}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_2"}, "class_name": "Activation"}, {"config": {"b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "bias": true, "W_constraint": null, "trainable": true, "activation": "linear", "output_dim": 10, "name": "dense_2", "W_regularizer": null, "input_dim": null, "init": "glorot_uniform"}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "softmax", "name": "activation_3"}, "class_name": "Activation"}], "class_name": "Sequential", "keras_version": "1.1.0"}