{"class_name": "Sequential", "keras_version": "1.1.2", "config": [{"class_name": "Convolution2D", "config": {"bias": true, "activity_regularizer": null, "dim_ordering": "th", "b_regularizer": null, "b_constraint": null, "activation": "linear", "W_regularizer": null, "nb_col": 3, "input_dtype": "float32", "W_constraint": null, "batch_input_shape": [null, 1, 28, 28], "init": "glorot_uniform", "nb_filter": 32, "nb_row": 3, "name": "convolution2d_1", "subsample": [1, 1], "border_mode": "valid", "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_1", "pool_size": [2, 2], "dim_ordering": "th", "trainable": true, "border_mode": "valid", "strides": [2, 2]}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"bias": true, "activity_regularizer": null, "output_dim": 128, "init": "glorot_uniform", "b_regularizer": null, "b_constraint": null, "W_regularizer": null, "W_constraint": null, "trainable": true, "input_dim": null, "name": "dense_1", "activation": "linear"}}, {"class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"bias": true, "activity_regularizer": null, "output_dim": 10, "init": "glorot_uniform", "b_regularizer": null, "b_constraint": null, "W_regularizer": null, "W_constraint": null, "trainable": true, "input_dim": null, "name": "dense_2", "activation": "linear"}}, {"class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "softmax"}}]}